Revit 2027 API
FaceToposolid.GetReferencedFaces Method
 Gets the referenced faces of the face toposolid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Reference> GetReferencedFaces()
Public Function GetReferencedFaces As IList(Of Reference)
public:
IList<Reference^>^ GetReferencedFaces()
member GetReferencedFaces : unit -> IList<Reference>
Return Value
IList<Reference>
 The referenced faces
See Also
Reference
FaceToposolid Class
Autodesk.Revit.DB Namespace